<template>
    <div class="mainbox">
        <div class="top_nav">
            <i class="el-icon-arrow-left" @click="goback"></i>
            <span>{{topnav.title}}</span>
        </div>
        <div class="content">
            <div style="margin-bottom: 0.3rem;text-align: center; color: #333; font-size: 0.65rem;">"百业会盟"用户协议</div>
            <div class="jianjie">
                <p class="suo">鉴于:</p>
                <p class="suo">爱之家商城为广州华项科技有限公司持有与经营的网络商城app。</p>
                <p class="suo">
                    广州华项科技有限公司与广州华磐网络科技有限公司 (以下简称“甲方”)达成合作。甲方开展“百业惠盟”项目，百业惠盟的用户、自然人或企业有权在爱之家商城及百业惠盟指定商家获得采购消费的折扣优惠。
                </p>
                <p class="suo">
                    本协议由甲方与使用“百业惠盟”服务的惠盟用户(以下简称“乙方”)共同缔结。当乙方点击确认本协议时，即表示乙方已充分阅读、理解并接受本协议的全部内容，并与甲方达成一致，即乙方同意并承诺遵守本协议规定，使用爱之家就“百业惠盟”项目提供折扣等优惠。本协议自乙方点击确认本协议且乙方支付本协议约定的全部款项之时生效。如果乙方不同意本协议或其中任何条款约定，乙方应立即停止协议项下的服务行为
                </p>
                <p class="suo">根据中华人民共和国相关法律、法规的有关规定，甲、乙双方经平等协商，一致同意签订本协议，共同遵守</p>
            </div>

            <div class="info">  
               
                   
                    <div class="mian">
                         <p>一、协议目的与期限</p>
                        <div class="suo">
                            1、甲方为“百业惠盟”项目的运营方，乙方向甲方支付完成平台服务费后成为甲方的惠盟用户（亦称“超级会员（大使）”，简称“用户”），享受甲方的惠盟商家提供的优惠与服务
                        </div>
                        <div class="suo">2、本协议有效期为壹年，自乙方点击确认且乙方已向甲方支付全部协议款项之日起生效。</div>
                    </div>
                      <div class="mian">
                          <p>二、合作内容</p>
                          <div class="suo">
                              1、乙方成为甲方“百业惠盟”用户享有甲方的惠盟商家提供的优惠与服务，并且甲方有权根据实际情况包括与惠盟商家达成的协议定时或不定时更新此优惠与服务内容，乙方应定期或在每次消费前及时查阅相关优惠内容及使用规则。
                          </div>
                          <div class="suo">2、乙方成为“百业惠盟”用户后可享受成为用户的优惠与服务。</div>
                      </div>
                    <div class="mian">
                        <p>三、乙方权利义务</p>
                        <div class="suo">
                            1、在遵守甲方公布的使用规则的前提下，乙方可享有“百业惠盟”指定商家给予的用户优惠，但有区域或其他限制使用的除外。如用户优惠与服务内容中有提供免费服务项目的，甲方根据乙方的常驻地址设定有区域或使用限制，具体以甲方或惠盟商家具体公布的使用规则为准
                        </div>
                        <div class="suo">
                            2、乙方成为惠盟用户后，可享受的权益以甲方届时公布的信息为准。为更好的向惠盟用户提供优惠服务，甲方有权基于自身业务发展的需要调整全部或部分惠盟用户的权益。甲方将就前述权益调整在相应服务页面进行通知或公告，用户可以通过“百业惠盟”平台网站查询最新的用户权益内容
                        </div>
                        <div class="suo">3、乙方成为甲方用户后可免费成为爱之家商城的代理商，经甲方同意后享有其代理商的相关权益。</div>
                        <div class="suo">
                            4、乙方亦可通过甲方合作平台分享链接推广百业惠盟，并且在成功推广（以对方全额支付完购买甲方平台服务费用为准）后，甲方给予乙方50元消费券，用于到店消费抵扣之用。具体以甲方公布的消费券使用规则为准。
                        </div>
                            <div class="suo">
                                5、乙方每次在甲方平台上“惠盟商家”专区显性标注的“惠盟商家”消费时，须在当次结账前向惠盟商家表明惠盟用户身份，出示用户二维码给惠盟商家扫码确认和记录，方可享受惠盟商家的优惠权益，拒绝配合惠盟商家验证，不能享受该商家优惠，责任在乙方。在非甲方平台上公开标注的其它商家消费，不能享受用户优惠，也与甲方无关。
                            </div>
                            <div class="suo">
                               6、本协议约定的用户权限仅限乙方购买甲方平台服务者本人使用，如甲方发现非乙方本人使用，一经发现，甲方有权解除本协议，终止乙方用户账户并不退还乙方已支付的平台服务费，乙方并须赔偿甲方及甲方惠盟商家遭受的全部损失(包括但不限于对甲方及甲方合作平台商誉、品牌等的影响)。
                            </div>
                            <div class="suo">
                                7、乙方成为甲方的用户后，乙方的帐号将绑定在“520平台”、“爱之家商城”（亦称“520爱之家”）乙方的帐号下，并在乙方的帐号里体现身份。乙方须自行并妥善保管其用户账号、密码并愿意承担因保管不善带来的全部损失。
                            </div>
                            <div class="suo">
                                8、乙方不得以甲方或甲方合作平台的名义开展任何业务、活动或者从事违法犯罪活动，否则一切后果由乙方负责，同时甲方保留追究法律和经济责任的权利。
                            </div>
                              <div class="suo">
                                  9、乙方应对双方的合作内容等一切信息承担保密义务，并且未经甲方书面许可，不得使用甲方的商标、商号、域名、专有名称、logo等。如果乙方违反本条款约定，视为违约，一经发现，甲方随时有权以单方面通知的形式解除本协议，全部责任由乙方自行承担，与甲方无关。
                              </div>
                    </div>
                        <div class="mian">
                            <p>四、成为用户的费用缴纳</p>
                            <div class="suo">
                          1、乙方应在点击确认本协议之时向甲方支付平台服务费¥365元（大写：人民币叁佰际拾伍元）。。
                            </div>
                            <div class="suo">
                                2、甲方有权根据向乙方提供的用户优惠内容增加或相关政策的变化，在乙方成为惠盟用户一年后调整其平台服务费的价格，乙方有权选择是否接受，如乙方接受，应在收到甲方的调整通知后5天内缴足。。
                            </div>
                                <div class="suo">
                                    3、涉及到用户收益时，双方应各自按照有关法律法规和国家政策的规定向有关的税务机关纳税。
                                </div>
                        </div>
                           <div class="mian">
                               <p>五、其他</p>
                               <div class="suo">
                                   1、除非有可以退款的另行有效合法约定或法律规定，乙方购买甲方的平台服务成为甲方的惠盟用户后，已收取的费用概不退还，并且无论何种原因因退款纠纷所发生的任何费用均由乙方自行承担。
                               </div>
                               <div class="suo">
                                   2、在本协议有效期内，当事任何一方事实上已终止正常存在，甲方有权终止本协议。
                               </div>
                               <div class="suo">
                             3、因履行本协议发生的纠纷，双方通过友好协商解决，协商不成的可以向广州仲裁委员会进行仲裁解决。
                               </div>
                                  <div class="suo">
                                     4、对于乙方违反国家相关法律，法规，恶意侵犯他人或其他涉及犯罪行为的事件，由乙方自行承担相全部的法律责任。。
                                  </div>
                                  <div class="suo">
                                      5、在合同有效期内乙方授予甲方及其关联公司、合作公司可在为乙方提供服务时查询使用乙方账号等信息。
                                  </div>
                                  <div class="suo">
                                      6、本协议内容包括协议正文以及甲方在甲方合作平台已经发布的或将来可能发布的所有各类规则、操作流程。甲方（广州华磐科技有限公司）及广州华项科技有限公司有权以修改、更新等方式不时调整本协议和相关规则的内容，相关内容将公布于甲方及广州华项科技有限公司旗下平台（百业惠盟、520平台、爱之家商城）上或以其他方式通知乙方。除非乙方明示并通知甲方不愿接受调整后的内容，否则调整后的内容将于公布之日或通知另行指定的日期开始生效。如果乙方不同意甲方在甲方合作平台所公布的任何条款约定，乙方应立即停止使用甲方提供的服务并及时通知甲方。。
                                  </div>
                                  <p>[以下无正文]</p>
                           </div>
                
                </div>    
        </div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                topnav: {
                    title: "用户协议"
                },
            }
        },
        mounted() {

        },
        methods: {
            goback() {

                // 从安卓和ios来的页面，返回时直接调用他们的方法，返回安卓和ios页面
                // h5页面如果返回去时没有上一级页面就直接返回首页，否则返回上一级页面
                // console.log(this.$route.query.from);

                if (this.$route.query.platform == 'android') {
                    window.action.backAPP();
                } else if (this.$route.query.platform == 'ios') {
                    window.action.backAPPiOS();
                } else {
                    this.$store.commit("bbb");
                    this.$router.go(-1)

                }

            },
        }
    }

</script>

<style scoped>
    .mainbox {
        background-color: #fff;
        box-sizing: border-box;

        font-size: 16px;
        color: #666;
        padding-top: 1.3rem;
       
    }

    .top_nav {
        width: 100%;
        height: 40px;
        background-color: #ff911e;
        color: #fff;
        display: flex;
        line-height: 40px;
        text-align: center;
        position: fixed;
        left: 0;
        top: 0;
        z-index: 9;
    }

    .top_nav i {
        flex: 1;
        line-height: 40px !important;
        font-size: 20px !important;
    }

    .top_nav span {
        flex: 9;
        font-size: 18px;
        text-indent: -50px;
    }

    .mainbox .content {

        padding: 1.3rem;

    }
    .mainbox .suo{
        text-indent: 2em;
        margin-bottom: 0.1rem;
    }
    .mainbox .jianjie {

        margin-bottom: 1.2rem;
    }

   .info .mian {
       margin-bottom: 0.5rem;
   }

</style>
